app/views/teams/index.html.erb

              <i class="bi bi-calendar"></i> Founded: <%= team.founded %><br>
              <i class="bi bi-person-badge"></i> Players: <%= team.players.count %>
---
SELECT `players`.* FROM `players` WHERE `players`.`team_id` IN (3, 4, 8, 10, 9, 7, 6, 5, 1, 2)
SELECT COUNT(*) FROM `players` WHERE `players`.`team_id` = 3