soccer-stats-backend/app/controllers/api/v1/ai_matches_controller.rb

  def simulate_match
    home_team = Team.find(params[:home_team_id])
    away_team = Team.find(params[:away_team_id])

    if home_team == away_team
      return render_error('Teams must be different for a match')
    end

    simulator = AiMatchSimulator.new
    simulation = simulator.simulate_match(home_team, away_team)

    # Optionally save the match if requested
    if params[:save_match] == 'true'
      match = Match.create!(
        home_team: home_team,
        away_team: away_team,
        home_score: simulation[:home_score],
        away_score: simulation[:away_score],
        match_date: params[:match_date] || 1.week.from_now
      )
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 8 LIMIT 1
INSERT INTO `matches` (`home_team_id`, `away_team_id`, `match_date`, `home_score`, `away_score`, `created_at`, `updated_at`) VALUES (10, 8, '2025-09-19 14:18:20.380138', 3, 2, '2025-09-12 14:18:20.386670', '2025-09-12 14:18:20.386670')

  def simulate_season
    if @teams.count < 2
      return render_error('Need at least 2 teams to simulate matches')
    end

    simulator = AiMatchSimulator.new
    simulated_matches = simulator.simulate_season_matches(@teams)

    # Save matches if requested
    if params[:save_matches] == 'true'
      created_matches = []

      simulated_matches.each do |match_data|
        match = Match.create!(match_data.except(:simulation_data))
        created_matches << format_match_data(match)
      end

      render_success({
        simulated_matches: simulated_matches,
        created_matches: created_matches,
        total_matches: created_matches.count,
        saved: true
      })
    else
      render_success({
        simulated_matches: simulated_matches,
        total_matches: simulated_matches.count,
        saved: false
      })
---
INSERT INTO `matches` (`home_team_id`, `away_team_id`, `match_date`, `home_score`, `away_score`, `created_at`, `updated_at`) VALUES (2, 3, '2026-02-27 17:47:36.517940', 2, 2, '2025-09-12 14:20:10.549293', '2025-09-12 14:20:10.549293')
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '1' OR away_team_id = '1') AND ((home_team_id = '1' AND home_score > away_score) OR (away_team_id = '1' AND away_score > home_score))

  def team_strength
    team = Team.find(params[:team_id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1

  def set_teams
    @teams = Team.all
    if @teams.empty?
---
SELECT `teams`.* FROM `teams`
SELECT 1 AS one FROM `teams` LIMIT 1