soccer-stats-backend/app/controllers/api/v1/players_controller.rb

  def index
    @players = Player.includes(:team).order(:name)
    @players = @players.where(position: params[:position]) if params[:position].present?

    players_data = @players.map do |player|
      {
        id: player.id,
        name: player.name,
        position: player.position,
        age: player.age,
        goals: player.goals,
        team: {
          id: player.team.id,
          name: player.team.name,
          city: player.team.city
        },
        created_at: player.created_at,
        updated_at: player.updated_at
      }
    end

    render_success({
      players: players_data,
      positions: Player.distinct.pluck(:position).compact.sort
---
SELECT `players`.* FROM `players` ORDER BY `players`.`name` ASC
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (4, 10, 8, 5, 1, 2)
SELECT DISTINCT `players`.`position` FROM `players`

  def show
    player_data = {
      id: @player.id,
      name: @player.name,
      position: @player.position,
      age: @player.age,
      goals: @player.goals,
      team: {
        id: @player.team.id,
        name: @player.team.name,
        city: @player.team.city,
        founded: @player.team.founded
      },
      teammates: @player.team.players.where.not(id: @player.id).order(:name).map do |teammate|
        {
          id: teammate.id,
          name: teammate.name,
          position: teammate.position,
          age: teammate.age,
          goals: teammate.goals
        }
      end,
      position_teammates: @player.team.players
        .where(position: @player.position)
        .where.not(id: @player.id)
        .order(:name)
        .map do |teammate|
---
SELECT `players`.* FROM `players` WHERE `players`.`team_id` = 10 AND `players`.`id` != 11 ORDER BY `players`.`name` ASC
SELECT `players`.* FROM `players` WHERE `players`.`team_id` = 10 AND `players`.`position` = 'Midfielder' AND `players`.`id` != 11 ORDER BY `players`.`name` ASC

  def create
    @player = @team.players.build(player_params)

    if @player.save
---
INSERT INTO `players` (`name`, `position`, `age`, `team_id`, `created_at`, `updated_at`) VALUES ('Simon Mignolet', 'Goalkeeper', 34, 10, '2025-09-12 13:37:29.520776', '2025-09-12 13:37:29.520776')

  def set_team
    if params[:team_id]
      @team = Team.find_by(id: params[:team_id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1

  def set_player
    @player = Player.find_by(id: params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 11 LIMIT 1