soccer-stats-backend/app/controllers/matches_controller.rb

  def index
    @matches = Match.includes(:home_team, :away_team).recent
    @matches = @matches.by_team(Team.find(params[:team_id])) if params[:team_id].present?
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (7, 5, 6, 4)
SELECT 1 AS one FROM `matches` WHERE (home_team_id = '10' OR away_team_id = '10') LIMIT 1
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1

  def new
    @match = Match.new
    @teams = Team.order(:name)
---
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC

  def create
    @match = Match.new(match_params)

    if @match.save
      redirect_to @match, notice: 'Match was successfully created.'
    else
      @teams = Team.order(:name)
---
INSERT INTO `matches` (`home_team_id`, `away_team_id`, `match_date`, `home_score`, `away_score`, `created_at`, `updated_at`) VALUES (8, 10, '2025-09-05 15:23:00', 2, 6, '2025-09-07 13:23:29.399839', '2025-09-07 13:23:29.399839')
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC

  def edit
    @teams = Team.order(:name)
---
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC

  def update
    if @match.update(match_params)
---
UPDATE `matches` SET `matches`.`home_team_id` = 7, `matches`.`away_team_id` = 10, `matches`.`match_date` = '2025-09-07 12:29:00', `matches`.`home_score` = 1, `matches`.`away_score` = 3, `matches`.`updated_at` = '2025-09-07 13:14:54.609995' WHERE `matches`.`id` = 1

  def set_match
    @match = Match.find(params[:id])
---
SELECT `matches`.* FROM `matches` WHERE `matches`.`id` = 1 LIMIT 1