soccer-stats-backend/app/controllers/teams_controller.rb

SELECT `players`.* FROM `players` WHERE `players`.`team_id` IN (3, 4, 8, 10, 9, 7, 6, 5, 1, 2)
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC
---
  def index
    @teams = Team.includes(:players).order(:name)

INSERT INTO `teams` (`name`, `city`, `founded`, `created_at`, `updated_at`) VALUES ('Club brugge KV', 'Brugge', 1985, '2025-09-07 12:52:40.098659', '2025-09-07 12:52:40.098659')
---
  def create
    @team = Team.new(team_params)

    if @team.save

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1
---
  def set_team
    @team = Team.find(params[:id])

SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '10' AND home_score > away_score) OR (away_team_id = '10' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '10' OR away_team_id = '10') AND home_score = away_score)
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '10' AND home_score < away_score) OR (away_team_id = '10' AND away_score < home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '10' OR away_team_id = '10')
---
  def calculate_team_stats(team)
    matches = team.all_matches
    wins = team.wins.count
    draws = team.draws.count
    losses = team.losses.count

    {
      matches_played: matches.count,
      wins: wins,
      draws: draws,
      losses: losses,
      points: (wins * 3) + draws,
      goals_for: goals_for(team),
      goals_against: goals_against(team)

SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`home_team_id` = 10
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`away_team_id` = 10
---
  def goals_for(team)
    home_goals = Match.where(home_team: team).sum(:home_score)
    away_goals = Match.where(away_team: team).sum(:away_score)

SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`home_team_id` = 10
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`away_team_id` = 10
---
  def goals_against(team)
    home_goals_against = Match.where(home_team: team).sum(:away_score)
    away_goals_against = Match.where(away_team: team).sum(:home_score)