soccer-stats-backend/app/views/players/show.html.erb

          <div class="col-3">
            <h4><%= @player.team.players.count %></h4>
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1
SELECT COUNT(*) FROM `players` WHERE `players`.`team_id` = 10

          <div class="col-3">
            <h4><%= @player.team.players.where(position: @player.position).count %></h4>
---
SELECT COUNT(*) FROM `players` WHERE `players`.`team_id` = 10 AND `players`.`position` = 'Midfielder'

          <div class="col-3">
            <h4><%= @player.team.all_matches.count %></h4>
---
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '10' OR away_team_id = '10')