app/controllers/api/v1/dashboard_controller.rb

  def index
    recent_matches = Match.includes(:home_team, :away_team).recent.limit(5)

    dashboard_data = {
      stats: {
        total_teams: Team.count,
        total_players: Player.count,
        total_matches: Match.count,
        recent_matches_count: recent_matches.count
      },
      recent_matches: recent_matches.map do |match|
        {
          id: match.id,
          home_team: { id: match.home_team.id, name: match.home_team.name },
          away_team: { id: match.away_team.id, name: match.away_team.name },
          home_score: match.home_score,
          away_score: match.away_score,
          match_date: match.match_date,
          winner_id: match.winner&.id
        }
      end,
      top_players: Player.joins(:team).limit(5).map do |player|
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (7, 8, 4, 5)
SELECT `players`.* FROM `players` INNER JOIN `teams` ON `teams`.`id` = `players`.`team_id` LIMIT 5
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `matches` LIMIT 5) subquery_for_count
SELECT COUNT(*) FROM `players`
SELECT COUNT(*) FROM `teams`

  def stats
    teams_with_stats = Team.all.map do |team|
      matches = team.all_matches
      wins = team.wins.count
      draws = team.draws.count
      losses = team.losses.count
      goals_for = goals_for(team)
      goals_against = goals_against(team)

      {
        team: {
          id: team.id,
          name: team.name,
          city: team.city,
          founded: team.founded
        },
        matches_played: matches.count,
        wins: wins,
        draws: draws,
        losses: losses,
        points: (wins * 3) + draws,
        goals_for: goals_for,
        goals_against: goals_against,
        goal_difference: goals_for - goals_against
      }
    end.sort_by { |stats| -stats[:points] }

    total_matches = teams_with_stats.sum { |stats| stats[:matches_played] } / 2
---
SELECT `teams`.* FROM `teams`
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score > away_score) OR (away_team_id = '1' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' OR away_team_id = '1') AND home_score = away_score)
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score < away_score) OR (away_team_id = '1' AND away_score < home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '1' OR away_team_id = '1')
SELECT COUNT(*) FROM `teams`

    stats_data = {
      league_table: teams_with_stats,
      league_overview: {
        total_teams: Team.count,
        total_matches: total_matches,
        total_goals: total_goals,
        average_goals_per_match: total_matches > 0 ? (total_goals.to_f / total_matches).round(2) : 0,
        total_wins: teams_with_stats.sum { |stats| stats[:wins] },
        total_draws: teams_with_stats.sum { |stats| stats[:draws] }
---
SELECT COUNT(*) FROM `teams`

  def goals_for(team)
    home_goals = Match.where(home_team: team).sum(:home_score)
    away_goals = Match.where(away_team: team).sum(:away_score)
---
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1

  def goals_against(team)
    home_goals_against = Match.where(home_team: team).sum(:away_score)
    away_goals_against = Match.where(away_team: team).sum(:home_score)
---
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1