app/controllers/api/v1/matches_controller.rb

  def index
    @matches = Match.includes(:home_team, :away_team).recent
    @matches = @matches.by_team(Team.find(params[:team_id])) if params[:team_id].present?

    matches_data = @matches.map do |match|
      {
        id: match.id,
        home_team: {
          id: match.home_team.id,
          name: match.home_team.name,
          city: match.home_team.city
        },
        away_team: {
          id: match.away_team.id,
          name: match.away_team.name,
          city: match.away_team.city
        },
        home_score: match.home_score,
        away_score: match.away_score,
        match_date: match.match_date,
        winner_id: match.winner&.id,
        is_draw: match.draw?,
        total_goals: match.total_goals,
        created_at: match.created_at,
        updated_at: match.updated_at
      }
    end

    render_success({
      matches: matches_data,
      teams: Team.order(:name).map { |t| { id: t.id, name: t.name } }
    })
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (7, 8, 4, 5, 6)
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC

  def set_match
    @match = Match.find_by(id: params[:id])
---
SELECT `matches`.* FROM `matches` WHERE `matches`.`id` = 1 LIMIT 1