app/controllers/api/v1/teams_controller.rb

SELECT `players`.* FROM `players` WHERE `players`.`team_id` IN (3, 4, 8, 10, 9, 7, 6, 5, 1, 2)
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC
SELECT COUNT(*) FROM `players` WHERE `players`.`team_id` = 3
---
  def index
    @teams = Team.includes(:players).order(:name)

    teams_data = @teams.map do |team|
      {
        id: team.id,
        name: team.name,
        city: team.city,
        founded: team.founded,
        players_count: team.players.count,
        created_at: team.created_at,
        updated_at: team.updated_at

SELECT `players`.* FROM `players` WHERE `players`.`team_id` = 1 ORDER BY `players`.`name` ASC
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (4, 5)
---
  def show
    team_stats = calculate_team_stats(@team)

    team_data = {
      id: @team.id,
      name: @team.name,
      city: @team.city,
      founded: @team.founded,
      players: @team.players.order(:name).map do |player|
        {
          id: player.id,
          name: player.name,
          position: player.position,
          age: player.age
        }
      end,
      stats: team_stats,
      recent_matches: @team.all_matches.recent.includes(:home_team, :away_team).limit(5).map do |match|

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
  def set_team
    @team = Team.find_by(id: params[:id])

SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score > away_score) OR (away_team_id = '1' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' OR away_team_id = '1') AND home_score = away_score)
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score < away_score) OR (away_team_id = '1' AND away_score < home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '1' OR away_team_id = '1')
---
  def calculate_team_stats(team)
    matches = team.all_matches
    wins = team.wins.count
    draws = team.draws.count
    losses = team.losses.count

    {
      matches_played: matches.count,
      wins: wins,
      draws: draws,
      losses: losses,
      points: (wins * 3) + draws,
      goals_for: goals_for(team),
      goals_against: goals_against(team)

SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1
---
  def goals_for(team)
    home_goals = Match.where(home_team: team).sum(:home_score)
    away_goals = Match.where(away_team: team).sum(:away_score)

SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1
---
  def goals_against(team)
    home_goals_against = Match.where(home_team: team).sum(:away_score)
    away_goals_against = Match.where(away_team: team).sum(:home_score)