app/views/matches/_form.html.erb

        <%= form.label :home_team_id, "Home Team", class: "form-label" %>
        <%= form.select :home_team_id,
            options_from_collection_for_select(@teams, :id, :name, match.home_team_id),
            { prompt: "Select Home Team" },
            { class: "form-select #{'is-invalid' if match.errors[:home_team].any?}",
              required: true } %>
---
SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC