app/views/matches/index.html.erb

      <p class="text-muted">
        Showing matches for <strong><%= Team.find(params[:team_id]).name %></strong>
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1