app/controllers/dashboard_controller.rb

  def index
    @recent_matches = Match.includes(:home_team, :away_team).recent.limit(5)
    @total_teams = Team.count
    @total_players = Player.count
    @total_matches = Match.count
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (2, 5, 6)
SELECT COUNT(*) FROM `teams`
SELECT COUNT(*) FROM `players`
SELECT COUNT(*) FROM `matches`

  def stats
    @teams_with_stats = Team.all.map do |team|
      matches = team.all_matches
      wins = team.wins.count
      draws = team.draws.count
      losses = team.losses.count

      {
        team: team,
        matches_played: matches.count,
        wins: wins,
        draws: draws,
        losses: losses,
        points: (wins * 3) + draws,
        goals_for: goals_for(team),
        goals_against: goals_against(team)
---
SELECT `teams`.* FROM `teams`
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score > away_score) OR (away_team_id = '1' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' OR away_team_id = '1') AND home_score = away_score)
SELECT COUNT(*) FROM `matches` WHERE ((home_team_id = '1' AND home_score < away_score) OR (away_team_id = '1' AND away_score < home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '1' OR away_team_id = '1')

  def goals_for(team)
    home_goals = Match.where(home_team: team).sum(:home_score)
    away_goals = Match.where(away_team: team).sum(:away_score)
---
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1

  def goals_against(team)
    home_goals_against = Match.where(home_team: team).sum(:away_score)
    away_goals_against = Match.where(away_team: team).sum(:home_score)
---
SELECT SUM(`matches`.`away_score`) FROM `matches` WHERE `matches`.`home_team_id` = 1
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`away_team_id` = 1