app/controllers/players_controller.rb

  def index
    @players = Player.includes(:team).order(:name)
    @players = @players.by_position(params[:position]) if params[:position].present?
    @positions = Player.distinct.pluck(:position).compact.sort
---
SELECT `players`.* FROM `players` ORDER BY `players`.`name` ASC
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (4, 5, 1, 2)
SELECT 1 AS one FROM `players` WHERE `players`.`position` = 'Defender' LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`position` = 'Defender' ORDER BY `players`.`name` ASC
SELECT DISTINCT `players`.`position` FROM `players`

  def create
    @player = @team.players.build(player_params)

    if @player.save
---
INSERT INTO `players` (`name`, `position`, `age`, `team_id`, `created_at`, `updated_at`) VALUES ('Hans Vanaken', 'Midfielder', 32, 10, '2025-09-07 13:22:43.645954', '2025-09-07 13:22:43.645954')

  def set_player
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 10 LIMIT 1

  def set_team
    if params[:team_id]
      @team = Team.find(params[:team_id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 10 LIMIT 1