soccer-stats-backend/app/services/ai_match_simulator.rb

  def get_team_stats(team)
    home_matches = team.home_matches
    away_matches = team.away_matches
    all_matches = Match.where('home_team_id = ? OR away_team_id = ?', team.id, team.id)

    wins = all_matches.where('(home_team_id = ? AND home_score > away_score) OR (away_team_id = ? AND away_score > home_score)', team.id, team.id).count
    draws = all_matches.where('home_score = away_score').count
    losses = all_matches.count - wins - draws

    goals_for = (home_matches.sum(:home_score) || 0) + (away_matches.sum(:away_score) || 0)
    goals_against = (home_matches.sum(:away_score) || 0) + (away_matches.sum(:home_score) || 0)

    {
      matches_played: all_matches.count,
      wins: wins,
      draws: draws,
      losses: losses,
      points: (wins * 3) + draws,
      goals_for: goals_for,
      goals_against: goals_against,
      goal_difference: goals_for - goals_against
---
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '10' OR away_team_id = '10') AND ((home_team_id = '10' AND home_score > away_score) OR (away_team_id = '10' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '8' OR away_team_id = '8') AND ((home_team_id = '8' AND home_score > away_score) OR (away_team_id = '8' AND away_score > home_score))
SELECT COUNT(*) FROM `matches` WHERE (home_team_id = '8' OR away_team_id = '8') AND (home_score = away_score)
SELECT SUM(`matches`.`home_score`) FROM `matches` WHERE `matches`.`away_team_id` = 8

  def get_random_player_name(team)
    # Try to get actual player, fallback to generic name
    if team.players.any?
---
SELECT `players`.* FROM `players` WHERE `players`.`team_id` = 10
SELECT 1 AS one FROM `players` WHERE `players`.`team_id` = 10 LIMIT 1